let year;
year = 2000;

if (((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0)) {
    console.log('Год является високосным (366 дней).');
}
else {
    console.log('Год не високосный (у него 365 дней).');
}


let year2;
year2 = 2014;

    if (year2 % 4 == 0) {
        if (year2 % 100 == 0) {
            if (year2 % 400 == 0) {
                console.log('Год является високосным (366 дней).');
            } else {
                console.log('Год не високосный (у него 365 дней).');
            }
        } else {
            console.log('Год является високосным (366 дней).');
        }
    } else {
        console.log('Год не високосный (у него 365 дней).');
    }
